<?php

return [


    'auth' => [
        'account_exists' => 'البريد الالكترونى  موجود من قبل',
        'register' => 'مرحبا بك فى تطبيق Randevou',
        'city_list' => 'عرص البيانات بنجاح',
        'key' => 'البريد الالكترونى غير صحيح',
        'check_email' => 'البريد الالكترونى غير صحيح',
        'login' => 'تسجيل الدخول بنجاح',
        'password' => 'كلمه المرور خاطئه',
        'email' => 'البريد الالكترونى غير صحيح',
        'phone' => 'رقم الهاتف  غير صحيح',
        'phone_correct' => 'رقم الهاتف موجود',
        'date_created'=>'تاريخ الانشاء مطلوب',
        'info'=>'تفاصيل عن العيادة',
        'communication_officer'=>'المسئول عن العيادة',
        'city_id'=>'يرجى اختيار المدينة',
        'image'=>'يرجى اختيار صورة',
        'qr_code'=>'يرجى رفع كيو ار كود',
        'qr_code_upload'=>' كيو ار كود العيادة',
        'phone_password' => 'تاكد من صحه البيانات',
        'phone_exist' => 'رقم الهاتف موجود من قبل',
        'phone_not_exist' => 'رقم الهاتف غير  موجود',
        'account_suspended' => 'تم ايقاف حسابك من قبل الادارة',
        'wrong_activate_code' => 'كود تفعيل خاطئ،حاول مرة اخرى',
        'activated_successfully' => 'تم تفعيل الحساب بنجاح',
        'active_account' => 'من فضلك فعل حسابك',
        'phone_not_exists' => 'لا يوجد حساب بهذا الرقم، تأكد من الرقم و حاول مره اخرى',
        'message_sent' => 'تفقد كود التفعيل في الرسائل',
        'message' => 'من فضلك ادخل رسالتك',
        'send message' => 'تم ارسال رسالتك بنجاح',
        'user_check' => 'برجاء عمل تسجيل دخول',
//        'user_check' => 'المستخدم غير موجود',
        'logout' => 'تم تسجيل خروج بنجاح',
        'forgetPassword' => 'تم تغير الباسورد بنجاح',

        'edit_profile' => 'تم تعديل بيانات البروفايل بنجاح',
        'email_another_account' => 'البريد الالكترونى مسجل لحساب اخر',
        'phone_another_account' => 'رقم الهاتف مسجل لحساب اخر',
        'reset_password_monthly_limit' => 'يمكنك طلب رمز إعادة تعيين كلمة المرور مرة واحدة فقط كل شهر',

        'address' => 'العنوان مطلوب',
        'lat' => 'العنوان مطلوب',
        'lng' => 'العنوان مطلوب',
        'name' => 'الاسم مطلوب',
        'code' => 'برجاء ادخال كود التفعيل',
    ],



    'profile' => [
        'user_details' => 'بيانات المستخدم',
        'added' => 'تم تسجيل بنجاح',
        'updated' => 'تم تعديل البيانات بنجاح',
        'password_updated' => 'تم تعديل كلمة المرور بنجاح',
        'wrong_old_password' => 'كلمة المرور القديمة غير صحيحة',
        'lang_updated' => 'تم تعديل اللغة بنجاح',
        'missing_details' => 'حدث خطأ ما, برجاء المحاولة لاحقا',
        'old_password_same_as_new' => 'كلمة المرور الجديدة يجب ان تكون مختلفة ان سابقتها',
        'info' => 'معلومات المستخدم',
        'logged_out' => 'تم تسجيل الخروج',
    ],
    'password' => 'كلمه المرور مطلوبة',

    'phone' => 'رقم الهاتف مطلوب',

    'email' => 'البريد الالكترونى مطلوب',

    'something_went_wrong' => 'حدث خطأ ما، برجاء المحاولة فيما بعد',
    'validate_lang'=>'يرجى ارسال اللغه بشكل صحيح',


    'cities' => [
        'all' => 'عرض المدن'
    ],
    'complaints_box' => [
        'all' => 'عرض الشكاوى',
        'reply' => 'الرد على رسالة العميل مطلوب',
        'send_reply' => 'تم الرد على رسالة العميل بنجاح',
        'id'=>'برجاء ارسال رقم الشكوى'
    ],

    'posts' => [
        'all' => 'عرض كل المنشورات',
        'content' => 'محتوى المنشور مطلوب',
        'image' => 'صورة المنشور مطلوب',
        'id'=>'برجاء ارسال رقم المنشور',
        'delete'=>'تم حذف المنشور بنجاح',
    ],
    'Added'=>'تم اضافة البيانات لنجاح',
    'updated' => 'تم تعديل البيانات بنجاح',
    'deleted' => 'تم حذف البيانات بنجاح',
    'update_status' => 'تم تغيير الحالة بنجاح',


    'department' => [
        'all' => 'عرض كل الاقسام',
        'name_ar' => 'القسم مطلوب باللغه العربية',
        'name_en' => 'القسم مطلوب باللغه الانجليزية',
        'id'=>'برجاء ارسال رقم القسم',
        'change_status'=>'تم تغيير حالة القسم بنجاح',
    ],

    'staff' => [
        'all' => 'عرض كل الموظفيين',
        'date_from' => 'تاريخ البداية من  مطلوب',
        'date_to' => 'تاريخ الى مطلوب',
        'id'=>'برجاء ارسال رقم القسم',
    ],


    'shift' => [
        'all' => 'عرض كل الشيفتات',
        'name' => 'اسم الشيفت مطلوب',
        'time_from' => 'بداية الشيفت  من  مطلوب',
        'time_to' => 'نهاية الشيفت الى مطلوب',
        'id'=>'برجاء ارسال رقم الشيفت',
        'status'=>'الحالة مطلوبه شفت ام اجازة',
        'minute_allow_delay'=>'الوقت المسموح للتاخير مطلوب',
    ],

    'specialties' => [
        'all' => 'عرض كل التخصصات',
        'id'=>'برجاء ارسال رقم التخصص',
        'delete'=>'تم حذف التخصص بنجاح',
    ],

    'offers' => [
        'all' => 'عرض كل العروض',
        'discount' => 'نسبة الخصم',
        'title_ar' => 'العنوان بالعربيه مطلوب',
        'title_en' => 'العنوان بالانجليزية مطلوب',
        'id'=>'برجاء ارسال رقم العرض',
        'delete'=>'تم حذف العرض بنجاح',
    ],

    'branches' => [
        'all' => 'عرض كل افرع العيادة',
        'id'=>'برجاء ارسال رقم الفرع',
        'change_status'=>'تم تغيير حالة الفرع بنجاح',
    ],

    'employees' => [
        'all' => 'عرض كل الموظفيين',
        'days' => 'عرض ايام الاسبوع',
        'doctor_degrees' => 'عرض الدرجة الوظيفيه للاطباء',
        'degree_id' => ' الدرجة الوظيفيه للطبيب مطلوبة',
        'gender' => 'نوع الجنس مطلوب',
        'specialist_ids' => 'التخصص مطلوب',
        'app_type' => 'قسم الموظف مطلوب',
        'id'=>'برجاء ارسال رقم الموظف والتاكد من الرقم',
        'delete'=>'تم حذف البيانات بنجاح',

        'permissions'=>'عرض كل الصلاحيات',
        'permission_ids'=>'يجب عليك اختيار صلاحية واحده على الاقل',
    ],
    'points'=>['all'=>'عرض النقاط'],
    'notifications'=>['all'=>'عرض الاشعارات'],
    'permissions'=>[
        'all'=>'عرض  انواع الاذونات',
        'send_permission' => 'تم ارسال طلب الاذن الى العيادة بنجاح',
        'permission_id'=>'برجاء ارسال نوع الاذن',
        'reason'=>'برجاء ارسال سبب الاذن',
    ],

    'attendance' => [
        'all' => 'عرض حضور الموظف',
        'absence' => 'غياب',
        'official_vacation' => 'اجازة رسمية',
        'status' => 'ادخل حاله الاذن',
        'check_in' => 'تم عمل حضور بنجاح',
        'check_out' => 'تم عمل انصراف بنجاح',
        'no_work' => 'عذرا هذا اليوم غير مسجل للعمل بالنسبة لك  ربما يكون أجازة رسمية برجاء الرجوع الى الإدارة للتاكد',
        'attendance_work' =>'برجاء الانتظار لحين بدا ميعاد الشيفت المحدد لك الساعة ',
        'attendance_already' =>'لا يمكنك عمل انصراف الا بعد الوقت المسموح من الإدارة ',
        'check_attendance_time' =>'لا يمكنك عمل حضور لتجاوزك الوقت المسموح من  قبل الإدارة  برجاء الرجوع اليهم',

    ],

    'data'=>'عرض البيانات بنجاح',


    'userApp' => [
        'clinics' => 'عرض العيادات',
        'absence' => 'غياب',
        'official_vacation' => 'اجازة رسمية',
        'status' => 'ادخل حاله الاذن',
    ],


    'rating' => [
        'send' => 'تم ارسال تقييمك بنحاح',
    ],

    'reservation_id_required'   => 'رقم الحجز مطلوب',
    'reservation_id_not_found'  => 'رقم الحجز غير موجود',

    'rate_required' => 'التقييم مطلوب',
    'rate_integer'  => 'التقييم يجب أن يكون رقمًا صحيحًا',
    'rate_min'      => 'أقل تقييم هو 1',
    'rate_max'      => 'أقصى تقييم هو 5',

    'comment_string' => 'التعليق يجب أن يكون نصًا',

    'reservation' => [
        'not_found'     => 'الحجز غير موجود',
        'already_rated' => 'تم تقييم هذا الحجز من قبل',
        'rate_success'  => 'تم إرسال التقييم بنجاح',

        'completed_success' => 'تم إنهاء الحجز بنجاح',
        'cannot_complete' => 'لا يمكن إنهاء الحجز في حالته الحالية',
    ],

    'reservation_not_found' => 'الحجز غير موجود',
    'reservation_already_rated' => 'تم تقييم هذا الحجز من قبل',
    'rating_submitted_successfully' => 'تم إرسال التقييم بنجاح',





];
